import React, { useEffect, useState } from "react";
import { Toaster, toast } from "react-hot-toast";
import { mainUrlApi } from "../../../Utils/Utils";
import DetailModal from "../../../Components/Modals/DetailModal/DetailModal";
import { requiredValidatior } from "../../../Components/InputBox/Validation/Rules";
import { useForm } from "../../../Hooks/useForm";
import EditModal from "../../../Components/Modals/EditModal/EditModal";
import InputBox from "../../../Components/InputBox/InputBox";
answer: 1;
body: "با سلام و وقت بخیر. در صورت امکان میخواستم در زمینه پشتیبانی سبزلرن باهاتون همکاری داشته باشم و ....";
course: null;
createdAt: "2023-01-05T09:40:10.516Z";
departmentID: "پشتیبانی";
departmentSubID: "پشتیبانی سایت";
isAnswer: 0;
priority: 1;
title: "درخواست همکاری";
updatedAt: "2023-01-05T16:09:39.693Z";
user: "محمدامین سعیدی راد";
__v: 0;
_id: "63b69afa12bd601354d496ed";

function TicketsAdmin() {
  const [allTickets, setAllTickets] = useState([]);
  const [mainTicket, setMainTicket] = useState();
  const [isModalDetail, setIsModalDetail] = useState(false);
  const [isAnswerModal, setIsAnswerModal] = useState(false);
  const [formState, onInputHandler] = useForm(
    {
      answer: {
        value: "",
        isValid: false,
      },
    },
    false
  );

  const allTicketsRender = () => {
    const localStorageData = JSON.parse(localStorage.getItem("token"));

    fetch(`${mainUrlApi}/tickets`, {
      headers: {
        Authorization: `Bearer ${localStorageData.token}`,
      },
    })
      .then((res) => res.json())
      .then((allTicketsData) => setAllTickets(allTicketsData));
  };
  const cancelShowMessageAction = () => {
    setIsModalDetail(false);
  };

  const actionAnswerHandler = (Ticket) => {
    setIsAnswerModal(true);
    setMainTicket(Ticket);
  };
  const answerAction = () => {
    if (formState.isFormValid) {
      const localStorageData = JSON.parse(localStorage.getItem("token"));

      const answerTicketObj = {
        ticketID: mainTicket._id,
        body: formState.inputs.answer.value.trim(),
      };

      fetch(`${mainUrlApi}/tickets/answer`, {
        method: "POST",
        headers: {
          Authorization: `Bearer ${localStorageData.token}`,
          "Content-Type": "application/json",
        },
        body: JSON.stringify(answerTicketObj),
      }).then((res) => {
        if (res.status === 200) {
          allTicketsRender();
          setIsAnswerModal(false);
          toast.success("پیغام با موفقیت ارسال شد");
        }
      });
    } else {
      toast.error("پیغام پاسخگویی را فراموش کرده اید");
    }
  };
  const cancelAnswerAction = () => {
    setIsAnswerModal(false);
  };

  const actionShowMessageHandler = (Ticket) => {
    setIsModalDetail(true);
    setMainTicket(Ticket);
  };

  useEffect(() => {
    allTicketsRender();
  }, []);
  return (
    <>
      <div className="hpc__part-section flex flex-col gap-5">
        <div className="panel-home__last-users__title hpc__title">
          لیست تیکت ها
        </div>
        {allTickets.length ? (
          <>
            <div className="overflow-x-auto">
              <table className="table text-center">
                <thead>
                  <tr>
                    <th>#</th>
                    <th>نام کاربر</th>
                    <th>عنوان</th>
                    <th>نوع تیکت</th>
                    <th>کنترل</th>
                  </tr>
                </thead>
                <tbody id="course-tbody-table">
                  {[...allTickets].reverse().map((ticket, index) => (
                    <tr key={ticket._id}>
                      <td
                        className={`${
                          ticket.answer === 1 ? "text-blue-500" : ""
                        }`}
                      >
                        {index + 1}
                      </td>
                      <td>{ticket.user}</td>
                      <td>{ticket.title}</td>
                      <td>
                        <button
                          onClick={() => actionShowMessageHandler(ticket)}
                          title="پیام را مشاهده کن"
                          className="inline-block seeDetailBtn"
                        >
                          <svg
                            width="24"
                            height="24"
                            viewBox="0 0 24 24"
                            fill="none"
                            xmlns="http://www.w3.org/2000/svg"
                          >
                            <path
                              d="M8.09562 20.8906L7.70135 21.5286L8.09562 20.8906ZM7.68699 20.6563L7.96312 19.959L7.68699 20.6563ZM6.85373 20.6736L7.0419 21.3996L6.85373 20.6736ZM7.24178 20.589L7.29956 21.3368L7.24178 20.589ZM3.34979 17.1696L2.62378 16.9814L3.34979 17.1696ZM3.43431 16.7812L4.18211 16.8386L3.43431 16.7812ZM3.13203 15.9282L2.49502 16.3241L3.13203 15.9282ZM3.36627 16.3347L2.6695 16.6122L3.36627 16.3347ZM2.95298 19.5094L3.68792 19.3598L2.95298 19.5094ZM4.51396 21.0704L4.66353 20.3354L4.51396 21.0704ZM8.05279 13.1078C7.63858 13.1078 7.30279 13.4436 7.30279 13.8578C7.30279 14.272 7.63858 14.6078 8.05279 14.6078V13.1078ZM16.0528 14.6078C16.467 14.6078 16.8028 14.272 16.8028 13.8578C16.8028 13.4436 16.467 13.1078 16.0528 13.1078V14.6078ZM8.05279 9.1078C7.63858 9.1078 7.30279 9.44359 7.30279 9.8578C7.30279 10.272 7.63858 10.6078 8.05279 10.6078V9.1078ZM12.0528 10.6078C12.467 10.6078 12.8028 10.272 12.8028 9.8578C12.8028 9.44359 12.467 9.1078 12.0528 9.1078V10.6078ZM5.48261 5.45926C9.09496 1.84691 14.9517 1.84691 18.5641 5.45926L19.6247 4.3986C15.4266 0.200466 8.62009 0.200466 4.42195 4.3986L5.48261 5.45926ZM18.5641 5.45926C22.1764 9.07161 22.1764 14.9284 18.5641 18.5407L19.6247 19.6014C23.8229 15.4033 23.8229 8.59674 19.6247 4.3986L18.5641 5.45926ZM3.76904 15.5323C2.68315 13.785 2.5484 11.8402 2.97494 10.0253C3.40407 8.19937 4.39389 6.54798 5.48261 5.45926L4.42195 4.3986C3.14228 5.67827 2.00974 7.57586 1.51472 9.68213C1.01712 11.7994 1.15644 14.1701 2.49502 16.3241L3.76904 15.5323ZM18.5641 18.5407C17.5261 19.5788 15.8769 20.5687 14.0348 21.0093C12.2032 21.4475 10.2366 21.332 8.4899 20.2526L7.70135 21.5286C9.8645 22.8653 12.2614 22.9759 14.3838 22.4682C16.4958 21.963 18.3911 20.835 19.6247 19.6014L18.5641 18.5407ZM8.4899 20.2526C8.30665 20.1393 8.12408 20.0227 7.96312 19.959L7.41086 21.3536C7.39817 21.3486 7.40673 21.3505 7.46297 21.3832C7.51725 21.4149 7.58911 21.4592 7.70135 21.5286L8.4899 20.2526ZM7.0419 21.3996C7.1463 21.3725 7.20817 21.3566 7.25518 21.3459C7.29944 21.3359 7.30684 21.3362 7.29956 21.3368L7.18399 19.8413C7.01304 19.8545 6.83467 19.9037 6.66555 19.9475L7.0419 21.3996ZM7.96312 19.959C7.69983 19.8547 7.46635 19.8194 7.18399 19.8413L7.29956 21.3368C7.34236 21.3335 7.35548 21.3358 7.3566 21.336C7.35771 21.3362 7.37094 21.3378 7.41086 21.3536L7.96312 19.959ZM4.0758 17.3578C4.11965 17.1886 4.16896 17.0101 4.18211 16.8386L2.68651 16.7239C2.68706 16.7166 2.68739 16.724 2.67741 16.7682C2.66678 16.8152 2.65085 16.877 2.62378 16.9814L4.0758 17.3578ZM2.49502 16.3241C2.56432 16.4356 2.6085 16.5068 2.64002 16.5606C2.67259 16.6162 2.67448 16.6247 2.6695 16.6122L4.06305 16.0572C3.99882 15.896 3.88211 15.7143 3.76904 15.5323L2.49502 16.3241ZM4.18211 16.8386C4.2038 16.5559 4.16796 16.3207 4.06305 16.0572L2.6695 16.6122C2.68515 16.6515 2.68692 16.665 2.68717 16.6666C2.68742 16.6683 2.68974 16.6817 2.68651 16.7239L4.18211 16.8386ZM2.62378 16.9814C2.46345 17.6 2.33331 18.1005 2.25755 18.5023C2.18244 18.9006 2.14238 19.2871 2.21805 19.659L3.68792 19.3598C3.67139 19.2786 3.66672 19.1241 3.73157 18.7803C3.79576 18.4399 3.91012 17.997 4.0758 17.3578L2.62378 16.9814ZM6.66555 19.9475C6.02634 20.1132 5.58349 20.2276 5.24309 20.2918C4.89922 20.3566 4.74477 20.352 4.66353 20.3354L4.36439 21.8053C4.73623 21.881 5.12276 21.8409 5.52105 21.7658C5.92283 21.69 6.42332 21.5599 7.0419 21.3996L6.66555 19.9475ZM2.21805 19.659C2.4381 20.7402 3.28313 21.5852 4.36439 21.8053L4.66353 20.3354C4.17205 20.2354 3.78794 19.8513 3.68792 19.3598L2.21805 19.659ZM8.05279 14.6078H16.0528V13.1078H8.05279V14.6078ZM8.05279 10.6078H12.0528V9.1078H8.05279V10.6078Z"
                              fill="var(--white-color)"
                            />
                          </svg>
                        </button>
                      </td>
                      <td className="flex justify-center">
                        <button
                          onClick={(e) => actionAnswerHandler(ticket)}
                          title="پاسخ"
                          className="inline-block seeDetailBtn"
                        >
                          <svg
                            width="24"
                            height="24"
                            viewBox="0 0 24 24"
                            fill="none"
                            xmlns="http://www.w3.org/2000/svg"
                          >
                            <path
                              d="M11.37 19.25C10.9558 19.25 10.62 19.5858 10.62 20C10.62 20.4142 10.9558 20.75 11.37 20.75V19.25ZM20.9182 10.8995L20.1753 11.0026V11.0026L20.9182 10.8995ZM21.0929 16.8297L21.7909 17.1041L21.0929 16.8297ZM18.8921 19.3573L18.5242 18.7037L18.8921 19.3573ZM17.69 4.45483L18.0025 3.77306V3.77306L17.69 4.45483ZM19.8217 6.31092L19.1894 6.71429L19.8217 6.31092ZM6.67429 4.45483L6.36174 3.77306V3.77306L6.67429 4.45483ZM2.70322 10.7963C2.64624 11.2066 2.93264 11.5853 3.34292 11.6423C3.75319 11.6993 4.13198 11.4129 4.18896 11.0026L2.70322 10.7963ZM4.54259 6.31092L3.91029 5.90756L4.54259 6.31092ZM4.98972 7.7368L5.52005 7.20647L5.51062 7.19704L5.50086 7.18795L4.98972 7.7368ZM19.99 6.87868L19.4597 6.34835V6.34835L19.99 6.87868ZM19.1319 7.7368L18.6015 7.20647L18.6015 7.20647L19.1319 7.7368ZM2 17.25C1.58579 17.25 1.25 17.5858 1.25 18C1.25 18.4142 1.58579 18.75 2 18.75V17.25ZM8 18.75C8.41421 18.75 8.75 18.4142 8.75 18C8.75 17.5858 8.41421 17.25 8 17.25V18.75ZM2 14.25C1.58579 14.25 1.25 14.5858 1.25 15C1.25 15.4142 1.58579 15.75 2 15.75V14.25ZM5 15.75C5.41421 15.75 5.75 15.4142 5.75 15C5.75 14.5858 5.41421 14.25 5 14.25V15.75ZM11.37 4.75H12.9942V3.25H11.37V4.75ZM12.9942 19.25H11.37V20.75H12.9942V19.25ZM20.1753 11.0026C20.3952 12.5859 20.5529 13.7262 20.5999 14.6241C20.6466 15.5146 20.5782 16.089 20.3949 16.5552L21.7909 17.1041C22.0871 16.3508 22.1495 15.5303 22.0979 14.5457C22.0467 13.5685 21.8773 12.3534 21.661 10.7963L20.1753 11.0026ZM12.9942 20.75C14.5663 20.75 15.7931 20.7506 16.7681 20.6669C17.7504 20.5825 18.5546 20.4079 19.26 20.0109L18.5242 18.7037C18.0876 18.9494 17.5281 19.0961 16.6397 19.1724C15.7439 19.2494 14.5927 19.25 12.9942 19.25V20.75ZM20.3949 16.5552C20.0371 17.4652 19.3764 18.2241 18.5242 18.7037L19.26 20.0109C20.4129 19.362 21.3068 18.3353 21.7909 17.1041L20.3949 16.5552ZM12.9942 4.75C14.2402 4.75 15.1326 4.75051 15.8386 4.80466C16.5352 4.85809 16.9938 4.96075 17.3774 5.13661L18.0025 3.77306C17.394 3.49408 16.7392 3.36933 15.9533 3.30905C15.1767 3.24949 14.2173 3.25 12.9942 3.25V4.75ZM17.3774 5.13661C18.1206 5.47729 18.7497 6.02507 19.1894 6.71429L20.454 5.90756C19.8591 4.97509 19.0079 4.23397 18.0025 3.77306L17.3774 5.13661ZM11.37 3.25C10.147 3.25 9.18756 3.24949 8.41097 3.30905C7.62503 3.36933 6.9703 3.49408 6.36174 3.77306L6.98683 5.13661C7.37044 4.96075 7.82905 4.85809 8.52568 4.80466C9.23166 4.75051 10.124 4.75 11.37 4.75V3.25ZM4.18896 11.0026C4.45672 9.07477 4.60786 8.02255 4.89827 7.27003L3.49887 6.72997C3.13038 7.6848 2.95958 8.9505 2.70322 10.7963L4.18896 11.0026ZM4.89827 7.27003C4.9799 7.05852 5.0705 6.87792 5.17489 6.71429L3.91029 5.90756C3.74645 6.1644 3.61237 6.43586 3.49887 6.72997L4.89827 7.27003ZM6.36174 3.77306C5.35631 4.23397 4.50514 4.97509 3.91029 5.90756L5.17489 6.71429C5.61456 6.02507 6.24368 5.47729 6.98683 5.13661L6.36174 3.77306ZM5.50086 7.18795L4.70971 6.45115L3.68743 7.54885L4.47858 8.28565L5.50086 7.18795ZM19.4597 6.34835L18.6015 7.20647L19.6622 8.26713L20.5203 7.40901L19.4597 6.34835ZM4.45939 8.26713C6.11107 9.9188 7.40205 11.212 8.54367 12.0831C9.7026 12.9673 10.7953 13.4868 12.0608 13.4868V11.9868C11.2552 11.9868 10.479 11.673 9.45354 10.8905C8.41073 10.0949 7.20171 8.88813 5.52005 7.20647L4.45939 8.26713ZM18.6015 7.20647C16.9199 8.88813 15.7108 10.0949 14.668 10.8905C13.6425 11.673 12.8664 11.9868 12.0608 11.9868V13.4868C13.3262 13.4868 14.419 12.9673 15.5779 12.0831C16.7195 11.212 18.0105 9.9188 19.6622 8.26713L18.6015 7.20647ZM2 18.75H8V17.25H2V18.75ZM2 15.75H5V14.25H2V15.75ZM21.661 10.7963C21.384 8.80147 21.2078 7.47896 20.7633 6.48414L19.3938 7.09613C19.7296 7.84754 19.884 8.90537 20.1753 11.0026L21.661 10.7963ZM20.7633 6.48414C20.6729 6.282 20.5709 6.09084 20.454 5.90756L19.1894 6.71429C19.2642 6.83165 19.3317 6.9573 19.3938 7.09613L20.7633 6.48414ZM20.5203 7.40901L20.6088 7.32047L19.5482 6.25981L19.4597 6.34835L20.5203 7.40901Z"
                              fill="var(--white-color)"
                            />
                          </svg>
                        </button>
                      </td>
                    </tr>
                  ))}
                </tbody>
              </table>
            </div>

            {isModalDetail && (
              <DetailModal
                typeInfoShow={"READ"}
                mainInfo={mainTicket}
                propertyName="body"
                cancelAction={cancelShowMessageAction}
              ></DetailModal>
            )}
            {isAnswerModal && (
              <EditModal
                updateAction={answerAction}
                cancelAction={cancelAnswerAction}
                userMainInfo={mainTicket}
                updateText="ارسال شو"
              >
                <InputBox
                  id="answer"
                  type="textarea"
                  placeHolder="پیغام پاسخگویی"
                  validations={[requiredValidatior()]}
                  onInputHandler={onInputHandler}
                ></InputBox>
              </EditModal>
            )}
          </>
        ) : (
          <div className="hpc__title text-[#dc3545] border-solid border-t border-white py-10 text-center">
            تیکتی ثبت نشده
          </div>
        )}
      </div>

      <Toaster></Toaster>
    </>
  );
}

export default TicketsAdmin;
